{"class_name": "Model", "keras_version": "2.2.4", "config": {"name": "model_1", "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_1", "config": {"name": "input_1", "dtype": "float32", "batch_input_shape": [null, null, null, 3], "sparse": false}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "block1_conv1", "config": {"use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "activation": "relu", "filters": 64, "dilation_rate": [1, 1], "trainable": false, "strides": [1, 1], "data_format": "channels_last", "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block1_conv1"}}, {"inbound_nodes": [[["block1_conv1", 0, 0, {}]]], "class_name": "Conv2D", "name": "block1_conv2", "config": {"use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "activation": "relu", "filters": 64, "dilation_rate": [1, 1], "trainable": false, "strides": [1, 1], "data_format": "channels_last", "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block1_conv2"}}, {"inbound_nodes": [[["block1_conv2", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "block1_pool", "config": {"pool_size": [2, 2], "strides": [2, 2], "name": "block1_pool", "data_format": "channels_last", "trainable": false, "padding": "valid"}}, {"inbound_nodes": [[["block1_pool", 0, 0, {}]]], "class_name": "Conv2D", "name": "block2_conv1", "config": {"use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "activation": "relu", "filters": 128, "dilation_rate": [1, 1], "trainable": false, "strides": [1, 1], "data_format": "channels_last", "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block2_conv1"}}, {"inbound_nodes": [[["block2_conv1", 0, 0, {}]]], "class_name": "Conv2D", "name": "block2_conv2", "config": {"use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "activation": "relu", "filters": 128, "dilation_rate": [1, 1], "trainable": false, "strides": [1, 1], "data_format": "channels_last", "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block2_conv2"}}, {"inbound_nodes": [[["block2_conv2", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "block2_pool", "config": {"pool_size": [2, 2], "strides": [2, 2], "name": "block2_pool", "data_format": "channels_last", "trainable": false, "padding": "valid"}}, {"inbound_nodes": [[["block2_pool", 0, 0, {}]]], "class_name": "Conv2D", "name": "nuclei_0_conv1", "config": {"use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "activation": "relu", "filters": 512, "dilation_rate": [1, 1], "trainable": true, "strides": [1, 1], "data_format": "channels_last", "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "nuclei_0_conv1"}}, {"inbound_nodes": [[["nuclei_0_conv1", 0, 0, {}]]], "class_name": "Conv2D", "name": "nuclei_0_conv2", "config": {"use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "activation": "relu", "filters": 512, "dilation_rate": [1, 1], "trainable": true, "strides": [1, 1], "data_format": "channels_last", "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "nuclei_0_conv2"}}, {"inbound_nodes": [[["nuclei_0_conv2", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_1", "config": {"trainable": true, "name": "dropout_1", "rate": 0.5, "seed": null, "noise_shape": null}}, {"inbound_nodes": [[["dropout_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "nuclei_2_conv1", "config": {"use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "activation": "relu", "filters": 512, "dilation_rate": [1, 1], "trainable": true, "strides": [1, 1], "data_format": "channels_last", "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "nuclei_2_conv1"}}, {"inbound_nodes": [[["nuclei_2_conv1", 0, 0, {}]]], "class_name": "Conv2D", "name": "nuclei_2_conv2", "config": {"use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "activation": "relu", "filters": 512, "dilation_rate": [1, 1], "trainable": true, "strides": [1, 1], "data_format": "channels_last", "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "nuclei_2_conv2"}}, {"inbound_nodes": [[["nuclei_2_conv2", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_2", "config": {"trainable": true, "name": "dropout_2", "rate": 0.5, "seed": null, "noise_shape": null}}, {"inbound_nodes": [[["dropout_2", 0, 0, {}]]], "class_name": "UpSampling2D", "name": "nuclei_2_upsample1", "config": {"size": [2, 2], "name": "nuclei_2_upsample1", "data_format": "channels_last", "trainable": true, "interpolation": "bilinear"}}, {"inbound_nodes": [[["nuclei_2_upsample1", 0, 0, {}]]], "class_name": "UpSampling2D", "name": "nuclei_2_upsample2", "config": {"size": [2, 2], "name": "nuclei_2_upsample2", "data_format": "channels_last", "trainable": true, "interpolation": "bilinear"}}, {"inbound_nodes": [[["nuclei_2_upsample2", 0, 0, {}]]], "class_name": "Conv2D", "name": "main_output", "config": {"use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "activation": "sigmoid", "filters": 1, "dilation_rate": [1, 1], "trainable": true, "strides": [1, 1], "data_format": "channels_last", "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "main_output"}}], "output_layers": [["main_output", 0, 0]], "input_layers": [["input_1", 0, 0]]}, "backend": "tensorflow"}